# 1
# == ტოლია
5 == 5
7 == 3
"a" == "a"
4 == 4
"cat" == "dog"

# != არ არის ტოლი
5 != 3
4 != 4
"a" != "b"
10 != 5
"hi" != "hi"

# > მეტია
5 > 3
2 > 7
10 > 10
100 > 99
-1 > -5

# < ნაკლებია
5 < 3
2 < 7
10 < 10
3 < 8
-10 < 0

# >= მეტია ან ტოლია
5 >= 5
6 >= 3
2 >= 8
10 >= 10
1 >= 0

# <= ნაკლებია ან ტოლია
5 <= 5
3 <= 6
9 <= 2
0 <= 0
-2 <= 4

# == ტოლია
5 == 5
7 == 3
"a" == "a"
4 == 4
"cat" == "dog"

# != არ არის ტოლი
5 != 3
4 != 4
"a" != "b"
10 != 5
"hi" != "hi"

# > მეტია
5 > 3
2 > 7
10 > 10
100 > 99
-1 > -5

# < ნაკლებია
5 < 3
2 < 7
10 < 10
3 < 8
-10 < 0

# >= მეტია ან ტოლია
5 >= 5
6 >= 3
2 >= 8
10 >= 10
1 >= 0

# <= ნაკლებია ან ტოლია
5 <= 5
3 <= 6
9 <= 2
0 <= 0
-2 <= 4

# 2
# and აბრუნებს ჭეშმარიტს თუ ორივე პირობა სწორია

# or აბრუნებს ჭეშმარიტს თუ ერთერთი მაინც სწორია

# not აბრუნებს პირიქითს რაც არის

# 3
# and
True and True
5 > 3 and 2 < 4
10 == 10 and 3 > 5

# or
True or False
5 < 3 or 2 < 4
10 == 9 or 3 > 5

# not
not True
not False
not 5 > 3

# 4
x = int(input())
y = 10
print(x > y)

# 5
name = input()
myname = "ilia"
print(name == myname)

# 6
age = int(input())
print(age > 13)
