# 1) flowchart არის სურათი სადაც ნაჩვენებია როგორ მუშაობს პროგრამა ნაბიჯ ნაბიჯ
# მაგალითად რა ხდება პირველად მერე მეორედ და ა შ
# algorithm არის ნაბიჯების გეგმა პროგრამისთვის რაც უნდა გააკეთოს
# natural language არის ჩვეულებრივი ადამიანის ენაზე დაწერილი ინსტრუქცია
# pseudocode არის რაღაც პროგრამის მსგავსი ენა მაგრამ არა ნამდვილი კოდი უფრო გეგმაა როგორ იმუშავებს კოდი

# 2) sequences ნიშნავს რომ კოდი სრულდება რიგრიგობით თავიდან ბოლომდე
# მაგალითი
print("gamarjoba")
print("rogor xart")
# ჯერ დაიბეჭდება hello და მერე world

# 3) iterations ნიშნავს ერთი და იგივე კოდის ბევრჯერ გამეორებას
# მაგალითად
for i in range(20):
    print("example")
# ეს დაბეჭდავს hi სამჯერ

# 5) დაბეჭდე შენი სახელი 20 ჯერ
for i in range(20):
    print("ilia")

# 6) დაბეჭდე რიცხვები 10მდე
for i in range(1, 11):
    print(i)

# 7) დაბეჭდე 1 დან 50 მდე ყველა კენტი რიცხვი
for i in range(1, 51, 2):
    print(i)

# 8) დაბეჭდე 1 დან 67 მდე ყველა ლუწი რიცხვი
for i in range(2, 67, 2):
    print(i)